# Задача 1. Неправильный таймер
# Петя писал таймер для телефона, но у него что-то пошло не так.
# Скопируйте программу в редактор, исправьте ошибки и убедитесь, что на
# экран выводятся числа с 10 до 0 и сообщение «Время вышло!».

# count = 10
#
# while count != 0:
#     print(count)
#     if count == 0:
#         print('Время вышло!')
#     count -= 1

# Задача 2. Тестируем приложение.
# Напишите программу, которая имитирует работу с приложением: программа
# спрашивает у пользователя «Продолжаем работать? 1/0: » до тех пор,
# пока пользователь не введёт 0, — после этого выводится сообщение:
# «Приложение закрывается…». В конце программы также выводится сообщение:
# «Работа завершена». Для создания бесконечного цикла используйте while True.

# flag = True
#
# while flag:
#     ask_stage_of_work = int(input("Продолжаем работать? 1/0: "))
#     if ask_stage_of_work == 0:
#         flag = False
#         print("Приложение закрывается…")
#         print("Работа завершена")

# Задача 3. Вирус
# Дима написал программу-вирус специально для того, чтобы проучить своего друга-должника,
# который никак не хочет возвращать скейтборд. Программа не даёт работать за компьютером
# и постоянно выводит на экран сообщение “Компьютер заблокирован. Вернёшь скейт - скажу
# код разблокировки!”. Как только вводится правильный код: вирус удаляется. Напишите такую
# же программу, которую написал Дима. Код не может начинаться с цифры 0.
# Пример:
# Компьютер заблокирован. Вернёшь скейт - скажу код разблокировки!
# Введите код: 1005
# Компьютер заблокирован. Вернёшь скейт - скажу код разблокировки!
# Введите код: 7777
# Компьютер заблокирован. Вернёшь скейт - скажу код разблокировки!
# Введите код: 550
# Код верный, завершаю работу...

password = 550
flag = True

while flag:
    print("Компьютер заблокирован. Вернёшь скейт - скажу код разблокировки!")
    enter_password = int(input("Введите код: "))
    if enter_password == password:
        flag = False
        print("Код верный, завершаю работу...")