# Задача 5. Маятник.
# Известно, что амплитуда качающегося маятника с каждым разом затухает на 8,4% от
# амплитуды предыдущего колебания. Если качнуть маятник, то, строго говоря, он не
# остановится никогда, просто амплитуда будет постоянно уменьшаться до тех пор, пока
# мы не сочтём такой маятник остановившимся.
# Что нужно сделать.
# Напишите программу, определяющую, сколько раз качнётся маятник, прежде чем он, по
# нашему мнению, остановится.
# Программа получает на вход начальную амплитуду колебания в сантиметрах и конечную
# амплитуду колебаний, которая считается остановкой маятника. Обеспечьте контроль ввода.
# Подсказка: для уменьшения числа можно умножить его на значение, которое меньше единицы.
# Например, уменьшение на 10%: 100 * 0.9 = 90.
# Пример.
# Введите начальную амплитуду: 1
# Введите амплитуду остановки: 0.1
# Маятник считается остановившимся через 27 колебаний

def count_swings(begin, end):
    count = 0
    memory_begin = begin
    while memory_begin >= end:
        memory_begin *= 0.916
        count += 1
    return count

start = float(input("Введите начальную амплитуду: "))
stop = float(input("Введите амплитуду остановки: "))
res = count_swings(start, stop)
print(f"Маятник считается остановившимся через {res} колебаний")

# procent = 1.0 - 0.084 # = 0.916
# print(procent)