# Задача 1. Меню ресторана.
# Ресторан заказал вам приложение, которое в один клик отображает пользователю меню.
# Для работы ресторан предоставил вам свой сайт, где можно найти меню в виде идущих
# подряд названий блюд в нижнем регистре.
# Напишите программу, которая выводит меню на экран. На вход подаётся строка из названий
# блюд, разделённых точкой с запятой, а на выходе названия перечисляются через запятую и
# пробел. Все названия блюд должны начинаться с заглавной буквы.
# Пример:
# Доступное меню: утиное филе;фланк-стейк;банановый пирог;плов
# На данный момент в меню есть: Утиное Филе, Фланк-Стейк, Банановый Пирог, Плов

def menu_available(menu):
    nice_view_text = ", ".join(menu.split(';')).title()
    return nice_view_text
menu_access = input('Доступное меню: ')
result = menu_available(menu_access)
print(f'На данный момент в меню есть: {result}')

